LATIN_TO_CYRILLIC = {
    'a': 'а', 'A': 'А',
    'b': 'б', 'B': 'Б',
    'd': 'д', 'D': 'Д',
    'e': 'е', 'E': 'Е',
    'f': 'ф', 'F': 'Ф',
    'g': 'г', 'G': 'Г',
    'h': 'ҳ', 'H': 'Ҳ',
    'i': 'и', 'I': 'И',
    'j': 'ж', 'J': 'Ж',
    'k': 'к', 'K': 'К',
    'l': 'л', 'L': 'Л',
    'm': 'м', 'M': 'М',
    'n': 'н', 'N': 'Н',
    'o': 'о', 'O': 'О',
    'p': 'п', 'P': 'П',
    'q': 'қ', 'Q': 'Қ',
    'r': 'р', 'R': 'Р',
    's': 'с', 'S': 'С',
    't': 'т', 'T': 'Т',
    'u': 'у', 'U': 'У',
    'v': 'в', 'V': 'В',
    'x': 'ҳ', 'X': 'Ҳ',
    'y': 'й', 'Y': 'Й',
    'z': 'з', 'Z': 'З',
    'ʼ': 'ъ',
    "O'": 'Ў', "o'": 'ў',
    'Sh': 'Ш', 'sh': 'ш',
    'Yu': 'Ю', 'yu': 'ю',
    'Ya': 'Я', 'ya': 'я',
    "G'": 'Ғ', "g'": 'ғ',
    'Yo': 'Ё', 'yo': 'ё'
}


letters = {'а': 'a', 'А': 'A', 'б': 'b', 'Б': 'B', 'д': 'd', 'Д': 'D', 'е': 'e', 'Е': 'E', 'ф': 'f', 'Ф': 'F', 'г': 'g', 'Г': 'G',
 'ҳ': 'x', 'Ҳ': 'X', 'и': 'i', 'И': 'I', 'ж': 'j', 'Ж': 'J', 'к': 'k', 'К': 'K', 'л': 'l', 'Л': 'L', 'м': 'm', 'М': 'M',
 'н': 'n', 'Н': 'N', 'о': 'o', 'О': 'O', 'п': 'p', 'П': 'P', 'қ': 'q', 'Қ': 'Q', 'р': 'r', 'Р': 'R', 'с': 's', 'С': 'S',
 'т': 't', 'Т': 'T', 'у': 'u', 'У': 'U', 'в': 'v', 'В': 'V', 'й': 'y', 'Й': 'Y', 'з': 'z', 'З': 'Z', 'ъ': 'ʼ',
 'Ў': "O'", 'ў': "o'", 'Ш': 'Sh', 'ш': 'sh', 'Ю': 'Yu', 'ю': 'yu', 'Я': 'Ya', 'я': 'ya', 'Ғ': "G'", 'ғ': "g'",
 'Ё': 'Yo', 'ё': 'yo', 'Э':'E', 'э': 'e', ' ': ' ', 'ы':'i', 'ь': ''}

s = 'Вы не могли бы говорить помедленнее'
n = ''.join(letters.get(i) for i in s)
print(n)